docs/quota/quota.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>quota</title>
<!-- 2015-04-05 Sun 12:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dmitry Monakhov" />
</head>
<body>
<div id="content">
<h1 class="title">quota</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Random thoughts, not related with a quota</a>
<ul>
<li><a href="#sec-1-1">Mark CT private-root directory with EXT\<sub>TOPDIR\</sub><sub>FL</sub></a></li>
<li><a href="#sec-1-2">register/unregister CT via vzctl</a></li>
</ul>
</li>
<li><a href="#sec-2">native quota support for containers.</a>
<ul>
<li><a href="#sec-2-1">Possible implementation for user/group quota.</a>
<ul>
<li><a href="#sec-2-1-1">Design</a></li>
<li><a href="#sec-2-1-2">Backward comatibility.</a></li>
<li><a href="#sec-2-1-3">Notes:</a></li>
</ul>
</li>
<li><a href="#sec-2-2">Common quota implemantation issues.</a>
<ul>
<li><a href="#sec-2-2-1">Choose suitable place to store CT-id on per-inode basis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span>&#xa0;<span class="Design">Design</span></span></a></li>
<li><a href="#sec-2-2-2">VE &lt;=&gt; VE files coping/movement issue.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span>&#xa0;<span class="Design">Design</span></span></a></li>
</ul>
</li>
<li><a href="#sec-2-3">Quota issues with your design.</a>
<ul>
<li><a href="#sec-2-3-1">think how and where to store quota files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span></span></a></li>
<li><a href="#sec-2-3-2">Be aware of hardcoded quota values&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Random thoughts, not related with a quota</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Mark CT private-root directory with EXT\<sub>TOPDIR\</sub><sub>FL</sub></h3>
<div class="outline-text-3" id="text-1-1">
<p>
ext3 trys to optimize block allocation relative to it's root-dir
(different dirs will use different block groups for allocation.T
his helps to reduce fragmentation). But in our case effectively
"<i>vz/private</i>" is the root of our tree. And we may mark it by
special flag: "sh chattr +T /vz/private"
Theoretically this may helps to reduce file fragmentation.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">register/unregister CT via vzctl</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><span class="underline">FIXME</span>: I'm not remember, but seems what is already done.
Introduce register/unregister actions for CT (vzctl)
In fact VE-private tree becomes complex structure
with complex structure long time ago, so plain copy
is may result in bad consequences even without quota.tree feature.
This is <span class="underline">must have</span> feature regardless to quota.
Register CT must have act simular VM's register/unregister.
It must check all requirements and fix if some necessery.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">native quota support for containers.</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Possible implementation for user/group quota.</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">Design</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>enlarge dqot<sub>t</sub> to 64 bit.
</li>
<li>Introduce new quota format for separate tree quota.
Which encode quot<sub>id</sub> as quot<sub>id</sub> = tree<sub>id</sub>&lt;&lt;32 + id;
</li>
<li>use global user/group file for all tries.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">Backward comatibility.</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>support virtual quota file "/root/ve/aquota.user" for backward 
compatibility with old quota-tools. The code is trivial.
It may be handled by VEFS or patched ext3 version.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">Notes:</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
PRO :: Straight and simple design. It is unlikely to brake well
tuned code, we just simply extending it with-out full redesigning.
CONT :: We have to support compat file for older quota-tools
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Common quota implemantation issues.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I've collect random issues which comes in to my mind.
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">Choose suitable place to store CT-id on per-inode basis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span>&#xa0;<span class="Design">Design</span></span></h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
possibilities are:
</p>
<ul class="org-ul">
<li>inside inode itself, only for ext4 (Or change ext3+lib2fs)
<span class="underline">note</span>: As i understand you already pick this one.
</li>
<li>or second xatrr will works for all fs, but with performance penalty
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">VE &lt;=&gt; VE files coping/movement issue.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span>&#xa0;<span class="Design">Design</span></span></h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
If we about to embed CT-id to inode, when we will have problems with
following user actions:
</p>
<ul class="org-ul">
<li>simple CT clone: cp -r private/{CTID\<sub>1</sub>} /private/{CTID\<sub>2</sub>}
Currently this action has no side effects except changes
in config file (netdev:hwaddr and etc.)
</li>
<li>copy/move/rename from file  private to private. Currently this is
prohibited by alexey@ because this result in incorrect quota on dst CT,
but now things becomes even worse because file moved will still
belongs to src CT quota.
</li>
</ul>
</div>

<ul class="org-ul"><li><a id="sec-2-2-2-1" name="sec-2-2-2-1"></a>Solution&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span></span><br  /><div class="outline-text-5" id="text-2-2-2-1">
<ul class="org-ul">
<li>We have to made some assumptions about fs-tree and check in run-time
in path\<sub>lookup</sub>, quota\<sub>fn</sub>, vefs\<sub>lookup</sub>:
</li>
</ul>
<p>
#+BEGIN<sub>SRC</sub> c
</p>
<ul class="org-ul">
<li>entry-&gt;d<sub>parent</sub>-&gt;tree<sub>id</sub> == entry-&gt;tree<sub>id</sub> (except for CT-root)
exceptions: must be marked explicitly by one of ext2<sub>extent</sub><sub>fl</sub> 
</li>
<li>CT may access only files in it's tree.
current<sub>ve</sub><sub>id</sub> == entry-&gt;tree<sub>id</sub> 
</li>
<li>VEFS check: if lower file is in private then
VEFS<sub>INFO</sub>(inode-&gt;i<sub>sb</sub>)-&gt;ve<sub>id</sub> == inode-&gt;lower<sub>file</sub>-&gt;tree<sub>id</sub>
</li>
</ul>
<p>
#+END<sub>SRC</sub> c
</p>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Quota issues with your design.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In short this means significant quota code redesign.
</p>
</div>
<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">think how and where to store quota files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span></span></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
We can't store quota files for all CTs in one plain quota array.
Otherwise MAXQUOTAS will be equals to NUM\<sub>PISSIBLE\</sub><sub>VE</sub> * 2 + 1 =~ 1000
</p>
<pre class="example">
don't forget anout this inode-&gt;i_dquot[MAXQUOTAS] 
</pre>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">Be aware of hardcoded quota values&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Impl">Impl</span></span></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
quotaops.h: sb<sub>any</sub><sub>quota</sub><sub>active</sub> directly rely on USR and GRP quota.
dquot.c: hashfn() redone according to
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dmitry Monakhov</p>
<p class="date">Created: 2015-04-05 Sun 12:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
